<template>
    <div>
        <div class="banner"></div>
        <div class="sky violet">活动须知</div>
        <div>
            <scroller ref="scroller" lock-x height="420px">
                <div class="skycontent">一、报名资格
                    <br/> 1、<span class="vio">基本要求</span>：【一路•纯悦2017（厦门）公益徒步】活动是一个团队参与的活动，倡导“一起健走，与爱同行”，因此，参与【一路•纯悦2017（厦门）公益徒步】活动每队必须由4人组成。报名参与人员要求年龄满4周岁以上，至65周岁以下，且身体健康。
                    <br/> 2、<span class="vio">身体要求</span>：【一路•纯悦2017（厦门）公益徒步】是一项行走活动，共分为亲子组和健行组，亲子组要求参赛者完成5公里的距离，健行组则需要进行20公里的长距离徒步，具有较强的挑战性。报名前请确认自己无先天性心脏病和风湿性心脏病、高血压和脑血管疾 病、心肌炎和其它心脏病、冠状动脉病患者和严重心律不齐者、血糖过高或过低的糖尿病等不适合长距离徒步的疾病或家族病史。我们建议大家自行到医院体检，确保自己身体状况适合长距离徒步。
                    <br/> 3、<span class="vio">活动费用</span>：本次活动不收取报名费用，但每队需要缴交报名押金费200元（每人50元），同时也作为组委会购置活动装备和队伍领取活动装备的依据，由队长统一支付。活动结束后1周内组委会将通过微信原路退回所交押金。
                    <br/> 4、<span class="vio">募款要求</span>：【一路•纯悦2017（厦门）公益徒步】是一场公益徒步筹款活动，每支队伍既要擅于行走，还需要有一颗善心，希望参与者能把自己参加【一路•纯悦2017（厦门）公益徒步】活动的消息，通过微信、电话、短信、邮件、微博等各种方式告知自己的亲朋好友，让他们支持您为爱挑战，为福建山区农村学校安装校园直饮净水设备，保证儿童在校期间能喝到干净、安全和足量的直饮水。所以，我们给每支队伍设置了最低400元的善款目标，上不封顶，为了孩子们，我们一起努力！
                    <br/> 5、<span class="vio">宣传要求</span>：【一路•纯悦2017（厦门）公益徒步】是一项大型公众参与活动，希望能向大众传播公益理念，因此，活动的影像记录会通过组委会认可的传播渠道进行传播。所以，所有报名成功的参与选手，即为默认并授权活动组织方及活动主赞助商在各渠道和场合使用其活动肖像权。
                    <br/> 6、<span class="vio">保险要求</span>：所有报名参加【一路•纯悦2017（厦门）公益徒步】活动的选手必须在报名前认真阅读、清楚知晓活动声明，以示对活动内容清楚明白。组委会将为各位参与者购买活动保险。由于组委会不能预测任何未知的情况，因此，所有报名参加活动的人员必须在仔细阅读“【一路•纯悦2017（厦门）公益徒步】活动声明”之后，做出参加【一路•纯悦2017（厦门）公益徒步】活动的决定。
                    <br/>二、不可抗力
                    基于天气情况、活动审批、活动安全等不可抗力因素，组委会可能会在报名成功后，做出诸如取消活动，合并或调配队伍成员，不接受某些报名者的行为。如果活动取消或者活动无法接受某些报名者，组委会都会及时告知各参赛者。
                    <br/><span class="red ">如有任何</span>关于本次【一路•纯悦2017（厦门）公益徒步】的<span class="red ">疑问</span>，请致电咨询：
                    <br/>厦门市登山户外运动协会 0592-2021117 或
                    <br/>厦门太古可口可乐饮料有限公司 0592-5707231 （工作日）
                    <br/>详情请留意“厦门太古可口可乐”官方公众号 或 厦门市登山户外运动协会官方微信号（xmdsxh)
                </div>
            </scroller>
        </div>
    </div>
</template>
<script>

    import {Scroller} from 'vux'

    export default {
        data() {
            return {
                picked: ''
            }
        },
        components: {
            Scroller
        },
        methods: {
            resetScroller() {
                this.$nextTick(() => {
                    this.$refs.scroller.reset();
                })
            }
        },
        mounted() {
            setTimeout(()=> {
                this.resetScroller();
            },1000)
        }
    }

</script>
<style scoped>
    .sky {
        width: 90%;
        margin: 0 auto;
        text-align: center;
        color: #fff;
        font-size: 18px;
        margin-bottom: 10px;
        padding: 5px;
    }
    .skycontent{
        width: 90%;
        margin: 0 auto;
        font-size: 14px;
        margin-bottom: 10px;
    }

</style>
